Some helpful boggle calculations.

#+begin_src j :session :exports both
W=: <@}:;._2(1!:1)<'cobble/share/collins.txt'

NB. words of given length
Let=: (W#~=&(#&>W))

NB. words that have anagrams in dictionary
Anag=: (#~1<#&>)@:(</.)~([:i.~(/:~&>))
AnagN=: Anag@Let

NB. valid backwards words
Back=: #~(e.|.&.>)
BackN=: Back@Let
#+end_src

#+RESULTS:

* Boggle Bits

** Common prefixes

This finds 10 most common 3-letter prefixes. Long words are likely
overrepresented, eg ~dis~ with disestablishmentarianism. Maybe this
skews things! 

#+begin_src j :session :exports both
5 {. \:~ (#;{.)/.~ 3 {."1 > W
#+end_src

#+RESULTS:
#+begin_example
┌────┬───┐
│2858│DIS│
├────┼───┤
│2752│CON│
├────┼───┤
│2505│PRE│
├────┼───┤
│2357│OVE│
├────┼───┤
│2215│PRO│
└────┴───┘
#+end_example

*** 3 letter prefixes to know
Recalculating on relevant words:

#+begin_src j :session :exports both
RWS =: ,/ (Let"0) 5 + i. 4 NB. relevant words (length 5-8)
10 {. \:~ (#;{.)/.~ (#~ ' '~:{:"1) 3 {."1 > RWS
#+end_src

#+RESULTS:
#+begin_example
┌───┬───┐
│640│OUT│
├───┼───┤
│543│PRE│
├───┼───┤
│480│CHA│
├───┼───┤
│459│PRO│
├───┼───┤
│457│MIS│
├───┼───┤
│434│CON│
├───┼───┤
│409│CAR│
├───┼───┤
│405│PAR│
├───┼───┤
│404│STA│
├───┼───┤
│381│FOR│
└───┴───┘
#+end_example

*** 4 letter prefixes



#+begin_src j :session :exports both
10 {. \:~ (#;{.)/.~ (#~ ' '~:{:"1) 4 {."1 > RWS
#+end_src

#+RESULTS:
#+begin_example
┌───┬────┐
│364│OVER│
├───┼────┤
│121│FORE│
├───┼────┤
│108│ANTI│
├───┼────┤
│101│OUTS│
├───┼────┤
│100│STRA│
├───┼────┤
│94 │CHAR│
├───┼────┤
│92 │BACK│
├───┼────┤
│91 │COMP│
├───┼────┤
│85 │PARA│
├───┼────┤
│79 │POST│
└───┴────┘
#+end_example

** Suffixes

*** Length 3

#+begin_src j :session :exports both
10 {. \:~ (#;{.)/.~ (#~ ' '~:{:"1) _3 {."1 > RWS
#+end_src

#+RESULTS:
#+begin_example
┌────┬───┐
│2901│ING│
├────┼───┤
│1571│ERS│
├────┼───┤
│1044│EST│
├────┼───┤
│870 │NGS│
├────┼───┤
│774 │IER│
├────┼───┤
│675 │IES│
├────┼───┤
│672 │ESS│
├────┼───┤
│608 │TED│
├────┼───┤
│594 │SES│
├────┼───┤
│483 │RED│
└────┴───┘
#+end_example

*** Length 4

#+begin_src j :session :exports both
10 {. \:~ (#;{.)/.~ (#~ ' '~:{:"1) _4 {."1 > RWS
#+end_src

#+RESULTS:
#+begin_example
┌───┬────┐
│832│INGS│
├───┼────┤
│742│IEST│
├───┼────┤
│509│LING│
├───┼────┤
│394│TING│
├───┼────┤
│359│LESS│
├───┼────┤
│323│ABLE│
├───┼────┤
│288│ERED│
├───┼────┤
│287│TERS│
├───┼────┤
│257│NESS│
├───┼────┤
│252│LIKE│
└───┴────┘
#+end_example

** Palindromes

Useful words which are the valid backwards and forwards

*** 4 Letter Palindromes

#+begin_src j :session :exports both
p4s=: _50 <\ > (#~ (2=#&>)) (</.~ (([: {. /:~ @ (; |.)) &. >)) BackN 4
(8!:2 p4s) (1!:2) <'report/palindrome-4.txt'
#+end_src

#+RESULTS:
: |domain error
: |   (    8!:2 p4s)(1!:2)<'report/palindrome-4.txt'


*** 5 Letter Palindromes

#+begin_src j :session :exports both
> (#~ (2 = # & >)) (</.~ (([: {. /:~ @ (; |.)) &. >)) BackN 5
#+end_src

#+RESULTS:
#+begin_example
...
│LARES│SERAL│
├─────┼─────┤
│LARUM│MURAL│
├─────┼─────┤
│LEBEN│NEBEL│
├─────┼─────┤
│LEEPS│SPEEL│
├─────┼─────┤
│LEETS│STEEL│
├─────┼─────┤
│LEPER│REPEL│
├─────┼─────┤
│LEVER│REVEL│
├─────┼─────┤
│LIART│TRAIL│
├─────┼─────┤
│LOGES│SEGOL│
├─────┼─────┤
│LOOKS│SKOOL│
├─────┼─────┤
│LOONS│SNOOL│
├─────┼─────┤
│LOOPS│SPOOL│
├─────┼─────┤
│LOOTS│STOOL│
├─────┼─────┤
│LOTOS│SOTOL│
├─────┼─────┤
│MARCS│SCRAM│
├─────┼─────┤
│MEETS│STEEM│
├─────┼─────┤
│METER│RETEM│
├─────┼─────┤
│MILKS│SKLIM│
├─────┼─────┤
│MOOLS│SLOOM│
├─────┼─────┤
│MOOPS│SPOOM│
├─────┼─────┤
│MURES│SERUM│
├─────┼─────┤
│MUTON│NOTUM│
├─────┼─────┤
│NAMER│REMAN│
├─────┼─────┤
│NAPAS│SAPAN│
├─────┼─────┤
│NARAS│SARAN│
├─────┼─────┤
│NARCS│SCRAN│
├─────┼─────┤
│NARKS│SKRAN│
├─────┼─────┤
│NELIS│SILEN│
├─────┼─────┤
│NEMAS│SAMEN│
├─────┼─────┤
│NEVES│SEVEN│
├─────┼─────┤
│NINER│RENIN│
├─────┼─────┤
│NOLOS│SOLON│
├─────┼─────┤
│NONET│TENON│
├─────┼─────┤
│NOOPS│SPOON│
├─────┼─────┤
│NOTES│SETON│
├─────┼─────┤
│OFFER│REFFO│
├─────┼─────┤
│OLLER│RELLO│
├─────┼─────┤
│PACER│RECAP│
├─────┼─────┤
│PARTS│STRAP│
├─────┼─────┤
│PEELS│SLEEP│
├─────┼─────┤
│PELAS│SALEP│
├─────┼─────┤
│PEONS│SNOEP│
├─────┼─────┤
│PERTS│STREP│
├─────┼─────┤
│POOLS│SLOOP│
├─────┼─────┤
│POONS│SNOOP│
├─────┼─────┤
│POORT│TROOP│
├─────┼─────┤
│POOTS│STOOP│
├─────┼─────┤
│PORTS│STROP│
├─────┼─────┤
│PURIS│SIRUP│
├─────┼─────┤
│RAGER│REGAR│
├─────┼─────┤
│RAGES│SEGAR│
├─────┼─────┤
│RAGUS
#+end_example

*** 6 Letter Palindromes

#+begin_src j :session :exports both
> (#~ (2 = # & >)) (</.~ (([: {. /:~ @ (; |.)) &. >)) BackN 6
#+end_src

#+RESULTS:
#+begin_example
┌──────┬──────┐
│AGENES│SENEGA│
├──────┼──────┤
│ANIMAL│LAMINA│
├──────┼──────┤
│ANIMES│SEMINA│
├──────┼──────┤
│BRACED│DECARB│
├──────┼──────┤
│DEFFER│REFFED│
├──────┼──────┤
│DEGAMI│IMAGED│
├──────┼──────┤
│DEMITS│STIMED│
├──────┼──────┤
│DENIER│REINED│
├──────┼──────┤
│DENIES│SEINED│
├──────┼──────┤
│DEPART│TRAPED│
├──────┼──────┤
│DEPORT│TROPED│
├──────┼──────┤
│DEPOTS│STOPED│
├──────┼──────┤
│DERATS│STARED│
├──────┼──────┤
│DERRIS│SIRRED│
├──────┼──────┤
│DESSES│SESSED│
├──────┼──────┤
│DEVILS│SLIVED│
├──────┼──────┤
│DEVOTS│STOVED│
├──────┼──────┤
│DEWANS│SNAWED│
├──────┼──────┤
│DIALER│RELAID│
├──────┼──────┤
│DIAPER│REPAID│
├──────┼──────┤
│DORMIN│NIMROD│
├──────┼──────┤
│DORTER│RETROD│
├──────┼──────┤
│DRAWER│REWARD│
├──────┼──────┤
│ELIDES│SEDILE│
├──────┼──────┤
│ELUTES│SETULE│
├──────┼──────┤
│EMMETS│STEMME│
├──────┼──────┤
│EPATER│RETAPE│
├──────┼──────┤
│ESPIAL│LAIPSE│
├──────┼──────┤
│EVILER│RELIVE│
├──────┼──────┤
│GELDER│REDLEG│
├──────┼──────┤
│HALLAN│NALLAH│
├──────┼──────┤
│LAHALS│SLAHAL│
├──────┼──────┤
│LANGER│REGNAL│
├──────┼──────┤
│LEVINS│SNIVEL│
├──────┼──────┤
│LOOTER│RETOOL│
├──────┼──────┤
│MARRUM│MURRAM│
├──────┼──────┤
│NAPPAS│SAPPAN│
├──────┼──────┤
│PUPILS│SLIPUP│
├──────┼──────┤
│RAGGAS│SAGGAR│
├──────┼──────┤
│RECAPS│SPACER│
├──────┼──────┤
│RECCOS│SOCCER│
├──────┼──────┤
│REDIPS│SPIDER│
├──────┼──────┤
│REDRAW│WARDER│
├──────┼──────┤
│REFLET│TELFER│
├──────┼──────┤
│REFLOW│WOLFER│
├───
#+end_example

#+begin_src j :session :exports both
> (#~ (2 = # & >)) (</.~ (([: {. /:~ @ (; |.)) &. >)) BackN 7
#+end_src

#+RESULTS:
#+begin_example
┌───────┬───────┐
│DEIFIER│REIFIED│
├───────┼───────┤
│DELIVER│REVILED│
├───────┼───────┤
│DENNETS│STENNED│
├───────┼───────┤
│DESSERT│TRESSED│
├───────┼───────┤
│GATEMAN│NAMETAG│
├───────┼───────┤
│OILLETS│STELLIO│
├───────┼───────┤
│REKNITS│STINKER│
├───────┼───────┤
│REKNOTS│STONKER│
├───────┼───────┤
│RELIVER│REVILER│
├───────┼───────┤
│SAGENES│SENEGAS│
├───────┼───────┤
│SALLETS│STELLAS│
└───────┴───────┘
#+end_example

#+begin_src j :session :exports both
> (#~ (2 = # & >)) (</.~ (([: {. /:~ @ (; |.)) &. >)) BackN 8
#+end_src

#+RESULTS:
: ┌────────┬────────┐
: │DESSERTS│STRESSED│
: ├────────┼────────┤
: │REDRAWER│REWARDER│
: └────────┴────────┘

#+RESULTS:

Useful letter combinations based on how many words they form.

** 3 letter combinations

*** 5 words

#+BEGIN_SRC j :session :exports both
>>_1{]combos3=: combos 3
#+END_SRC

#+RESULTS:
: ┌───┬───┬───┬───┬───┐
: │ATE│EAT│ETA│TAE│TEA│
: └───┴───┴───┴───┴───┘

*** 4 words

#+BEGIN_SRC j :session :exports both
>>_2{combos3
#+END_SRC

#+RESULTS:
#+begin_example
┌───┬───┬───┬───┐
│ABO│BAO│BOA│OBA│
├───┼───┼───┼───┤
│AHS│ASH│HAS│SHA│
├───┼───┼───┼───┤
│ASP│PAS│SAP│SPA│
├───┼───┼───┼───┤
│ARY│RAY│RYA│YAR│
├───┼───┼───┼───┤
│BOR│BRO│ORB│ROB│
├───┼───┼───┼───┤
│BRU│BUR│RUB│URB│
├───┼───┼───┼───┤
│DOS│DSO│ODS│SOD│
├───┼───┼───┼───┤
│HOS│OHS│SHO│SOH│
├───┼───┼───┼───┤
│OWT│TOW│TWO│WOT│
└───┴───┴───┴───┘
#+end_example

*** 3 words

#+BEGIN_SRC j :session :exports both
>>_3{combos3
#+END_SRC

#+RESULTS:
#+begin_example
┌───┬───┬───┐
│ALB│BAL│LAB│
├───┼───┼───┤
│ARB│BAR│BRA│
├───┼───┼───┤
│ABS│BAS│SAB│
├───┼───┼───┤
│ADS│DAS│SAD│
├───┼───┼───┤
│AKE│KAE│KEA│
├───┼───┼───┤
│ANE│EAN│NAE│
├───┼───┼───┤
│ARE│EAR│ERA│
├───┼───┼───┤
│EAS│SAE│SEA│
├───┼───┼───┤
│AYE│YAE│YEA│
├───┼───┼───┤
│ARF│FAR│FRA│
├───┼───┼───┤
│AGS│GAS│SAG│
├───┼───┼───┤
│AIR│RAI│RIA│
├───┼───┼───┤
│AIT│ITA│TAI│
├───┼───┼───┤
│KOA│OAK│OKA│
├───┼───┼───┤
│ASK│KAS│SKA│
├───┼───┼───┤
│ALP│LAP│PAL│
├───┼───┼───┤
│ALS│LAS│SAL│
├───┼───┼───┤
│MAN│MNA│NAM│
├───┼───┼───┤
│AMP│MAP│PAM│
├───┼───┼───┤
│ARM│MAR│RAM│
├───┼───┼───┤
│MAS│SAM│SMA│
├───┼───┼───┤
│ANS│NAS│SAN│
├───┼───┼───┤
│ANT│NAT│TAN│
├───┼───┼───┤
│AWN│NAW│WAN│
├───┼───┼───┤
│APO│OPA│POA│
├───┼───┼───┤
│APT│PAT│TAP│
├───┼───┼───┤
│PAY│PYA│YAP│
├───┼───┼───┤
│ARS│RAS│SAR│
├───┼───┼───┤
│ART│RAT│TAR│
├───┼───┼───┤
│ATS│SAT│TAS│
├───┼───┼───┤
│AYS│SAY│YAS│
├───┼───┼───┤
│TAW│TWA│WAT│
├───┼───┼───┤
│BIO│BOI│OBI│
├───┼───┼───┤
│BOS│OBS│SOB│
├───┼───┼───┤
│CHI│HIC│ICH│
├───┼───┼───┤
│COR│ORC│ROC│
├───┼───┼───┤
│CRU│CUR│RUC│
├───┼───┼───┤
│DEI│DIE│IDE│
├───┼───┼───┤
│DEL│ELD│LED│
├───┼───┼───┤
│DEN│END│NED│
├───┼───┼───┤
│DOL│LOD│OLD│
├───┼───┼───┤
│DOR│ORD│ROD│
├───┼───┼───┤
│DUO│OUD│UDO│
├───┼───┼───┤
│EEN│ENE│NEE│
├───┼───┼───┤
│EEW│EWE│WEE│
├───┼───┼───┤
│ERF│FER│REF│
├───┼───┼───┤
│EFT│FET│TEF│
├───┼───┼───┤
│ENG│GEN│NEG│
├───┼───┼───┤
│EGO│GEO│GOE│
├───┼───┼───┤
│ERG│GER│REG│
├───┼───┼───┤
│EHS│HES│SHE│
├───┼───┼───┤
│ETH│HET│THE│
├───┼───┼───┤
│HEY│HYE│YEH│
├───┼───┼───┤
│EUK│KUE│UKE│
├───┼───┼───┤
│ELS│LES│SEL│
├───┼───┼───┤
│ELT│LET│TEL│
├───┼───┼───┤
│EMU│MEU│UME│
├───┼───┼───┤
│ORE│REO│ROE│
├───┼───┼───┤
│PER│PRE│REP│
├───┼───┼───┤
│ERS│RES│SER│
├───┼───┼───┤
│EST│SET│TES│
├───┼───┼───┤
│SEY│SYE│YES│
├───┼───┼───┤
│EWT│TEW│WET│
├───┼───┼───┤
│WEY│WYE│YEW│
├───┼───┼───┤
│FOR│FRO│ORF│
├───┼───┼───┤
│GNU│GUN│NUG│
├───┼───┼───┤
│GUS│SUG│UGS│
├───┼───┼───┤
│HOM│MHO│OHM│
├───┼───┼───┤
│HOO│OHO│OOH│
├───┼───┼───┤
│HOP│PHO│POH│
├───┼───┼───┤
│KIS│SIK│SKI│
├───┼───┼───┤
│ISM│MIS│SIM│
├───┼───┼───┤
│INS│NIS│SIN│
├───┼───┼───┤
│IOS│ISO│OIS│
├───┼───┼───┤
│PIS│PSI│SIP│
├───┼───┼───┤
│ITS│SIT│TIS│
├───┼───┼───┤
│MOS│OMS│SOM│
├───┼───┼───┤
│MUS│SUM│UMS│
├───┼───┼───┤
│NOO│ONO│OON│
├───┼───┼───┤
│NOS│ONS│SON│
├───┼───┼───┤
│NOW│OWN│WON│
├───┼───┼───┤
│NOY│ONY│YON│
├───┼───┼───┤
│NUR│RUN│URN│
├───┼───┼───┤
│NUS│SUN│UNS│
├───┼───┼───┤
│NYS│SNY│SYN│
├───┼───┼───┤
│OPS│POS│SOP│
├───┼───┼───┤
│OPT│POT│TOP│
├───┼───┼───┤
│ORT│ROT│TOR│
├───┼───┼───┤
│PUS│SUP│UPS│
└───┴───┴───┘
#+end_example

** 4 letter combinations

*** 10 words

#+BEGIN_SRC j :session :exports both
>(#~ (10 = #) & >) AnagN 4
#+END_SRC

#+RESULTS:
: ┌────┬────┬────┬────┬────┬────┬────┬────┬────┬────┐
: │ATES│EAST│EATS│ETAS│SATE│SEAT│SETA│TAES│TASE│TEAS│
: └────┴────┴────┴────┴────┴────┴────┴────┴────┴────┘

*** 7 words

#+BEGIN_SRC j :session :exports both
>(#~ (7 = #) & >) AnagN 4
#+END_SRC

#+RESULTS:
: ┌────┬────┬────┬────┬────┬────┬────┐
: │ARES│ARSE│EARS│ERAS│RASE│SEAR│SERA│
: ├────┼────┼────┼────┼────┼────┼────┤
: │ARIL│LAIR│LARI│LIAR│LIRA│RAIL│RIAL│
: ├────┼────┼────┼────┼────┼────┼────┤
: │ARLE│EARL│LAER│LARE│LEAR│RALE│REAL│
: ├────┼────┼────┼────┼────┼────┼────┤
: │OWTS│STOW│SWOT│TOWS│TWOS│WOST│WOTS│
: └────┴────┴────┴────┴────┴────┴────┘

*** 6 words

#+BEGIN_SRC j :session :exports both
>(#~ (6 = #) & >) AnagN 4
#+END_SRC

#+RESULTS:
#+begin_example
┌────┬────┬────┬────┬────┬────┐
│ABLE│ALBE│BAEL│BALE│BEAL│BLAE│
├────┼────┼────┼────┼────┼────┤
│AIDS│DAIS│DISA│SADI│SAID│SIDA│
├────┼────┼────┼────┼────┼────┤
│AIRS│ARIS│RAIS│RIAS│SAIR│SARI│
├────┼────┼────┼────┼────┼────┤
│ALES│LASE│LEAS│SALE│SEAL│SLAE│
├────┼────┼────┼────┼────┼────┤
│ALME│LAME│LEAM│MALE│MEAL│MELA│
├────┼────┼────┼────┼────┼────┤
│AMES│MAES│MASE│MESA│SAME│SEAM│
├────┼────┼────┼────┼────┼────┤
│ANES│EANS│NAES│SANE│SEAN│SENA│
├────┼────┼────┼────┼────┼────┤
│APTS│PAST│PATS│SPAT│STAP│TAPS│
├────┼────┼────┼────┼────┼────┤
│ARED│DARE│DEAR│EARD│RADE│READ│
├────┼────┼────┼────┼────┼────┤
│ARTS│RAST│RATS│STAR│TARS│TSAR│
├────┼────┼────┼────┼────┼────┤
│AVEL│LAVE│LEVA│VALE│VEAL│VELA│
├────┼────┼────┼────┼────┼────┤
│DEER│DERE│DREE│ERED│REDE│REED│
├────┼────┼────┼────┼────┼────┤
│DEIL│DELI│DIEL│EILD│IDLE│LIED│
├────┼────┼────┼────┼────┼────┤
│DERO│DOER│DORE│REDO│RODE│ROED│
├────┼────┼────┼────┼────┼────┤
│EELS│ELSE│LEES│SEEL│SELE│SLEE│
├────┼────┼────┼────┼────┼────┤
│EMES│MEES│MESE│SEEM│SEME│SMEE│
├────┼────┼────┼────┼────┼────┤
│ENTS│NEST│NETS│SENT│STEN│TENS│
├────┼────┼────┼────┼────┼────┤
│EROS│ORES│REOS│ROES│ROSE│SORE│
├────┼────┼────┼────┼────┼────┤
│HOPS│PHOS│POHS│POSH│SHOP│SOPH│
├────┼────┼────┼────┼────┼────┤
│LATE│LEAT│TAEL│TALE│TEAL│TELA│
├────┼────┼────┼────┼────┼────┤
│OPTS│POST│POTS│SPOT│STOP│TOPS│
├────┼────┼────┼────┼────┼────┤
│RUES│RUSE│SUER│SURE│URES│
#+end_example

** 5 letter combinations

*** 13 words

#+BEGIN_SRC j :session :exports both
>(#~ (13 = #) & >) AnagN 5
#+END_SRC

#+RESULTS:
: ┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
: │APERS│APRES│ASPER│PARES│PARSE│PEARS│PRASE│PRESA│RAPES│REAPS│SPAER│SPARE│SPEAR│
: ├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
: │ARETS│ASTER│EARST│RATES│REAST│RESAT│STARE│STEAR│STRAE│TARES│TASER│TEARS│TERAS│
: └─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘

*** 12 words

#+BEGIN_SRC j :session :exports both
>(#~ (12 = #) & >) AnagN 5
#+END_SRC

#+RESULTS:
: ┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
: │LEAST│LEATS│SALET│SETAL│SLATE│STALE│STEAL│STELA│TAELS│TALES│TEALS│TESLA│
: └─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘

*** 10 words

#+BEGIN_SRC j :session :exports both
>(#~ (10 = #) & >) AnagN 5
#+END_SRC

#+RESULTS:
: ┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
: │DEILS│DELIS│DIELS│EILDS│IDLES│ISLED│SIDLE│SIELD│SILED│SLIDE│
: ├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
: │DEROS│DOERS│DORES│DORSE│DOSER│REDOS│RESOD│RODES│ROSED│SORED│
: ├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
: │LAPSE│LEAPS│PALES│PEALS│PELAS│PLEAS│SALEP│SEPAL│SPALE│SPEAL│
: └─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘

#+BEGIN_SRC j :session :exports both
>(#~ (9 = #) & >) AnagN 5
#+END_SRC

#+RESULTS:
#+begin_example
┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
│ACERS│ACRES│CARES│CARSE│ESCAR│RACES│SCARE│SCRAE│SERAC│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│AIRTS│ARTIS│ASTIR│RAITS│SITAR│STAIR│STRIA│TARSI│TIARS│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ARLES│EARLS│LAERS│LARES│LASER│LEARS│RALES│REALS│SERAL│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│AVELS│LAVES│LEVAS│SALVE│SELVA│SLAVE│VALES│VALSE│VEALS│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│EPRIS│PERIS│PIERS│PRIES│PRISE│RIPES│SPEIR│SPIER│SPIRE│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ESTER│REEST│RESET│STEER│STERE│TEERS│TERES│TERSE│TREES│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│RIOTS│ROIST│ROSIT│ROSTI│ROTIS│TIROS│TORSI│TRIOS│TROIS│
└─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘
#+end_example

*** 9 words

#+RESULTS:
#+begin_example
┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
│ACERS│ACRES│CARES│CARSE│ESCAR│RACES│SCARE│SCRAE│SERAC│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ARLES│EARLS│LAERS│LARES│LASER│LEARS│RALES│REALS│SERAL│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│AVELS│LAVES│LEVAS│SALVE│SELVA│SLAVE│VALES│VALSE│VEALS│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│AIRTS│ARTIS│ASTIR│RAITS│SITAR│STAIR│STRIA│TARSI│TIARS│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ESTER│REEST│RESET│STEER│STERE│TEERS│TERES│TERSE│TREES│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│EPRIS│PERIS│PIERS│PRIES│PRISE│RIPES│SPEIR│SPIER│SPIRE│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│RIOTS│ROIST│ROSIT│ROSTI│ROTIS│TIROS│TORSI│TRIOS│TROIS│
└─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘
#+end_example

*** 8 words

#+BEGIN_SRC j :session :exports both
>(#~ (8 = #) & >) AnagN 5
#+END_SRC

#+RESULTS:
#+begin_example
┌─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
│ABETS│BASTE│BATES│BEAST│BEATS│BESAT│BETAS│TABES│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ALMES│LAMES│LEAMS│MALES│MEALS│MELAS│MESAL│SAMEL│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│AMENS│MANES│MANSE│MEANS│MENSA│NAMES│NEMAS│SAMEN│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ANTIS│NATIS│SAINT│SATIN│STAIN│TAINS│TIANS│TINAS│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│APERT│APTER│PATER│PEART│PETAR│PRATE│TAPER│TRAPE│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ASPEN│NAPES│NEAPS│PANES│PEANS│SNEAP│SPANE│SPEAN│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│HEROS│HOERS│HORSE│HOSER│ROHES│SHERO│SHOER│SHORE│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│INSET│NEIST│NITES│SENTI│SIENT│STEIN│TEINS│TINES│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│LEAPT│LEPTA│PALET│PELTA│PETAL│PLATE│PLEAT│TEPAL│
├─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│PASTE│PATES│PEATS│SEPTA│SPATE│SPEAT│TAPES│TEPAS│
└─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘
#+end_example
